Repository: shabdashala/shabdashala-backend
Catalog: locale/*/LC_MESSAGES/django.po
Languages: te_in

source: Email can not be used. Please use other email.
te_in: ఈ ఈమెయిలు ఉపయోగించబడదు. దయచేసి మరొక ఈమెయిలు ఉపయోగించండి.

source: Too many failed login attempts. Try again later.
te_in: మీరు ప్రవేశించడానికి చేసిన ప్రయత్నాలు చాలా విఫలమయ్యాయి. కొంత విరామం తరువాత మళ్ళీ ప్రయత్నించండి.

source: A user is already registered with this e-mail address.
te_in: ఈ ఈమెయిలు చిరునామాతో వినియోగదారు ఇప్పటికే నమోదు చేయబడ్డారు. క్రొత్థ ఖాతా తెరువుట కొరకు మీరు మరొక ఈమెయిలును ఉపయోగించండి.

source: Personal info
te_in: వ్యక్తిగత సమాచారం

source: Permissions
te_in: అనుమతులు

source: Important dates
te_in: ముఖ్యమైన తేదీలు

source: groups
te_in: సమూహాలు

source: The two password fields didn't match.
te_in: మీరు నమోదు చేసిన రెండుసంకేతపదాలు సరిపోలలేదు.

source: Password
te_in: సంకేతపదం

source: Password confirmation
te_in: సంకేతపదాన్ని నిర్దారించండి

source: Enter the same password as above, for verification.
te_in: ధృవీకరణ కోసం పైన నమోదు చేసిన అదే సంకేతపదమును నమోదు చేయండి.

source: Raw passwords are not stored, so there is no way to see this user's password, but you can change the password using <a href="password/">this form</a>.
te_in: ముడి సంకేతపదాలు నిల్వ చేయబడవు, కాబట్టి ఈ వినియోగదారుడి సంకేతపదమును చూడటానికి మార్గం లేదు, కానీ మీరు <a href="password/">ఈ పత్రము</a> ఉపయోగించి సంకేతపదమును మార్చవచ్చు.

source: first name
te_in: మొదటి పేరు

source: last name
te_in: ఇంటి పేరు

source: Phone number
te_in: చరవాణి సంఖ్య

source: gender
te_in: లింగం

source: staff status
te_in: సిబ్బంది హోదా

source: Designates whether the user can log into this admin site.
te_in: వినియోగదారు ఈ నిర్వాహక ప్రదేశంలోకి ప్రవేశించగలరా అని నిర్దేశిస్తుంది.

source: active
te_in: క్రియాశీలంగా ఉన్నారా?

source: Designates whether this user should be treated as active. Unselect this instead of deleting accounts.
te_in: ఈ వినియోగదారుని చురుకుగా పరిగణించాలా వద్దా అని నిర్దేశిస్తుంది. ఖాతాలను తొలగించడానికి బదులుగా దీన్ని ఎంపిక తీసివేయండి.

source: Designates whether this user should change his password during the next login.
te_in: వినియోగదారు యొక్క సంకేతపదాన్ని తదుపరి ప్రవేశ సమయములో మార్పించాలా వద్దా అని నిర్దేశిస్తుంది.

source: date joined
te_in: ఖాతా తెరిచిన తేదీ

source: user
te_in: వినియోగదారు

source: users
te_in: వినియోగదారులు

source: Device ID
te_in: పరికరం యొక్క గుర్తింపు సంఖ్య

source: Unique device identifier
te_in: పరికరం యొక్క ప్రత్యేక గుర్తింపు సంఖ్య

source: Key
te_in: తాళం చెవి

source: Date Created
te_in: సృష్టించబడిన తేదీ

source: Date Removed
te_in: తొలగించబడిన తేదీ

source: device token
te_in: పరికర చిహ్నము

source: device tokens
te_in: పరికర చిహ్నములు

source: Invalid credentials!
te_in: ఈమెయిలు మరియు సంకేతపదం కలయిక ఖాతాతో సరిపోలలేదు!

source: Please reset your password to access your account.
te_in: దయచేసి మీ ఖాతాలోకి ప్రవేశించడానికి ముందు మీ సంకేతపదంను మార్చండి.

source: This email address hasn't been registered with us.
te_in: ఈ ఈమెయిలు చిరునామాతో మా దగ్గర ఏ వినియోగదారుడి ఖాతా లేదు.

source: User account is disabled.
te_in: వినియోగదారు ఖాతా నిలిపివేయబడింది.

source: Incorrect Password. Please try again!
te_in: మీరు సరైన సంకేతపదంను పొదుపరచలేదు. దయచేసి మళ్ళీ ప్రయత్నించండి!

source: Unable to log in with provided credentials.
te_in: మీరు అందించిన ఈమెయిలు మరియు సంకేతపదం ఆధారాలతో ప్రవేశం అవ్వడం సాధ్యం కాలేదు.

source: Your E-mail address is not verified. A verification e-mail is sent to your inbox.
te_in: మీ ఈమెయిలు చిరునామా ధృవీకరించబడలేదు. ధృవీకరణ కోసం వివరాలతో మీకు ఈమెయిలు పంపబడుతుంది.

source: Name
te_in: పేరు

source: Description
te_in: వివరణ

source: Meta title
te_in: మెటా శీర్షిక

source: Meta description
te_in: మెటా వివరణ

source: Image
te_in: చిత్రం

source: Slug
te_in: స్లగ్

source: Is public
te_in: అందరికి తెలిసేదా?

source: Show this category in search results and categories listings.
te_in: శోధన ఫలితాలు మరియు వర్గాల జాబితాలలో ఈ వర్గాన్ని చూపించు.

source: Ancestor categories are public
te_in: పూర్వీకుల వర్గాలు అందరికి తెలిసేవా?

source: The ancestors of this category are public
te_in: ఈ వర్గానికి చెందిన పూర్వీకులు అందరికి కనపడతారు

source: Display order
te_in: ప్రదర్శన క్రమం

source: Category
te_in: వర్గం

source: Categories
te_in: వర్గాలు

source: Configured
te_in: నిర్దిష్టమయిన

source: Dynamic
te_in: క్రియాశీలక

source: Multiple choice answer question
te_in: బహుళ ఎంపిక జవాబు ప్రశ్న

source: Multiple choice multiple answer question
te_in: బహుళ ఎంపిక బహుళ జవాబు ప్రశ్న

source: Jumbled word answer question
te_in: గందరగోళ పద జవాబు ప్రశ్న

source: Translation question
te_in: అనువాద ప్రశ్న

source: Quiz type
te_in: ప్రశ్నల పరీక్ష రకం

source: Maximum number of questions
te_in: ప్రశ్నల గరిష్ట సంఖ్య

source: Maximum marks
te_in: గరిష్ట మార్కులు

source: Maximum bonus marks
te_in: గరిష్ట బహుమాన మార్కులు

source: Has been published?
te_in: ప్రచురించబడిందా?

source: Random Order
te_in: యాదృచ్ఛిక క్రమం

source: Display the questions in a random order or as they are set?
te_in: ప్రశ్నలను యాదృచ్ఛిక క్రమంలో ప్రదర్శించాలా లేదా అవి పొందుపరిచిన క్రమంలో ప్రదర్శించాలా?

source: Pass Mark
te_in: ఉత్తీర్ణత సాధించాల్సిన మార్కు

source: Percentage required to pass exam.
te_in: పరీక్షలో ఉత్తీర్ణత సాధించాల్సిన శాతం.

source: Displayed if user passes.
te_in: వినియోగదారు ఉత్తీర్ణులైతే ప్రదర్శించబడుతుంది.

source: Success Text
te_in: విజయ వచనం

source: Fail Text
te_in: వైఫల్యం వచనం

source: Displayed if user fails.
te_in: వినియోగదారు విఫలమైతే ప్రదర్శించబడుతుంది.

source: Correct answer is NOT shown after question. Answers displayed at the end.
te_in: ప్రశ్న తర్వాత సరైన సమాధానం చూపబడదు. సమాధానాలు చివరిలో ప్రదర్శించబడతాయి.

source: Answers at end
te_in: చివరికి సమాధానాలు

source: If yes, the result of each attempt by a user will be stored. Necessary for marking.
te_in: అవును అయితే, వినియోగదారు చేసిన ప్రతి ప్రయత్నం ఫలితం నిల్వ చేయబడుతుంది. మార్కింగ్ కోసం అవసరం.

source: Exam Paper
te_in: పరీక్షా పత్రం

source: Question type
te_in: ప్రశ్న రకం

source: Maximum Marks
te_in: గరిష్ట మార్కులు

source: Is this answer correct?
te_in: ఈ సమాధానం సరైనదేనా?

source: Quiz
te_in: ప్రశ్నల పరీక్ష

source: User
te_in: వినియోగదారు

source: Total Score
te_in: మొత్తం స్కోరు

source: Was this attempt correct?
te_in: ఈ ప్రయత్నం సరైనదేనా?

source: Marks Obtained
te_in: వచ్చిన మార్కులు

source: text
te_in: పదాలు

source: Show this category in search results and word listings.
te_in: శోధన ఫలితాలు మరియు పద జాబితాలలో ఈ వర్గాన్ని చూపించు.

source: Ancestor words are public
te_in: పూర్వ మాటలు అందరికీ చూపాలా?

source: The ancestors of this word are public
te_in: పూర్వ మాటలు అందరికీ ప్రదర్శించబడతాయి

source: Word
te_in: పదం

source: Words
te_in: పదాలు

source: Telugu
te_in: తెలుగు

source: Hindi
te_in: హిందీ

source: German
te_in: జర్మన్

source: English
te_in: ఆంగ్లము

source: ShabdaShala
te_in: శబ్దశాల

source: Login
te_in: ప్రవేశించు

source: Social Login
te_in: పరివారజాలఖాతాలు ద్వారా ప్రవేశించు

source: Facebook
te_in: ఫేస్బుక్

source: Email
te_in: ఈమెయిలు

source: Remember me
te_in: నా ప్రవేశాన్ని గుర్తు పెట్టు

source: Forgot your password?
te_in: మీ ఖాతా యొక్క సంకేతపదంను మర్చిపోయారా?

source: Create account
te_in: ఖాతాను సృష్టించండి

source: Sign Out
te_in: బయటకు వెళ్ళు

source: Are you sure you want to sign out?
te_in: మీరు ఖఛ్చితంగా బయటకు వెళ్ళాలి అనుకుంటున్నారా?

source: Change Password
te_in: సంకేతపదంను మార్చండి

source: Forgot Password?
te_in: సంకేతపదంను మర్చిపోయారా?

source: Password Reset
te_in: సంకేతపదంను మార్చండి

source: Forgotten your password? Enter your e-mail address below, and we'll send you an e-mail allowing you to reset it.
te_in: మీ యొక్క సంకేతపదంను మర్చిపోయారా? దయచేసి మీ ఈమెయిలు చిరునామాని క్రింద ఇవ్వండి. మేము మీ సంకేతపదంను ఎలా మార్చాలో వివరిస్తాము.

source: Reset My Password
te_in: నా సంకేతపదంను మార్చండి

source: Please contact us if you have any trouble resetting your password.
te_in: మీ సంకేతపదంను మార్చే ప్రక్రియలో మీకు ఏమైనా సమస్య ఉంటే దయచేసి మమ్మల్ని సంప్రదించండి

source: We have sent you an e-mail. Please contact us if you do not receive it within a few minutes.
te_in: మేము మీకు ఈమెయిలు పంపాము. మీరు కొద్ది నిమిషాల్లో అందుకోకపోతే దయచేసి మమ్మల్ని సంప్రదించండి.

source: Bad Token
te_in: చెత్త గుర్తు

source: change password
te_in: సంకేతపదంను మార్చండి

source: Your password is now changed.
te_in: మీ సంకేతపదం ఇప్పుడు మార్చబడింది.

source: Set Password
te_in: సంకేతపదంను నమోదుచేయ్యండి

source: Signup
te_in: ఖాతా తెరవండి

source: Already have a ShabdaShala account? Login
te_in: మీరు ఇప్పటికే శబ్దశాల ఖాతాని కలిగి ఉన్నారా? అయితే ప్రవేశించండి

source: We are sorry, but the sign up is currently closed.
te_in: మమ్మల్ని క్షమించండి, ఖాతా తెరిచే ప్రక్రియ ప్రస్తుతానికి మూసివేయబడింది.

source: Go back to Login page
te_in: తిరిగి ప్రవేశ పేజీకి వెళ్ళండి

source: Verify Your E-mail Address
te_in: మీ ఈమెయిలు చిరునామాను నిర్దారించండి

source: This part of the site requires us to verify that you are who you claim to be. For this purpose, we require that you verify ownership of your e-mail address.
te_in: మీ శబ్దశాల ఖాతాకి అనుసంధానించి ఉన్న ఈమెయిలు చిరునామా వినియోగంలో ఉన్నదని ధృవీకరణ అవసరం. ఈ ప్రయోజనం కోసం, మీరు మీ ఈమెయిలుకు యజమాని అని ధృవీకరించవలసినదిగా మేము కోరుతున్నాము.

source: <strong>Note:</strong> you can still <a href="%(email_url)s">change your e-mail address</a>.
te_in: <strong>గమనిక</strong>: మీరు ఇప్పటికీ మీ <a href="%(email_url)s">ఈమెయిలు చిరునామాను మార్చవచ్చు</a>.

source: Dashboard
te_in: ఎదురు పలక

source: About us
te_in: మా గురించి

source: A start-up that builds the technical tools needed to easily teach, learn and research languages.
te_in: భాషలను సులభంగా బోధించడానికి, నేర్చుకోవడానికి మరియు పరిశోధించడానికి కావలసినటువంటి సాంకేతిక సాధనాలను నిర్మించే అంకుర సంస్థ.

source: Languages
te_in: భాషలు

source: Sentences
te_in: వాక్యాలు

source: Social Network Login Failure
te_in: పరివారజాలము ద్వారా ప్రవేశించడం విఫలం అయ్యింది

source: An error occurred while attempting to login via your social network account.
te_in: మీ పరివారజాలఖాతా ద్వారా ప్రవేశ ప్రయత్నంలో లోపం సంభవించింది.

source: Account Connections
te_in: ఖాతాతో అనుసంధానం కలిగి ఉన్నవి

source: You can sign in to your account using any of the following third party accounts:
te_in: మీరు ఈ క్రింది పరివారజాలఖాతాలలో దేనినైనా ఉపయోగించి మీ ఖాతాలోకి ప్రవేశించవచ్చు.

source: Remove
te_in: తొలగించు

source: You currently have no social network accounts connected to this account.
te_in: ప్రస్తుతం మీ ఖాతాకు అనుసంధానించబడిన పరివారజాలఖాతాలు ఏమీ లేవు.

source: Add a 3rd Party Account
te_in: పరివారజాలఖాతాను అనుసంధానించండి

source: Login Cancelled
te_in: ప్రవేశం రద్దు చేయబడింది

source: You decided to cancel logging in to our site using one of your existing accounts. If this was a mistake, please proceed to <a href="%(login_url)s">sign in</a>.
te_in: మీరు మీ పరివారజాలఖాతా ఉపయోగించి శబ్దశాలలో ప్రవేశించాలని ప్రయత్నిస్తూ విఫలం చెందారు. ఇది పొరపాటు అయితే, దయచేసి ఈ <a href="%(login_url)s">ప్రవేశ లింక్</a> ద్వారా కొనసాగండి

source: The social account has been connected.
te_in: పరివారజాలఖాతా అనుసంధానించబడినది.

source: The social account is already connected to a different account.
te_in: ఈ పరివారజాలఖాతా ఇప్పటికే వేరే శబ్దశాల వినియోగదారుడి ఖాతాకు అనుసంధానం అయ్యి ఉన్నది.

source: The social account has been disconnected.
te_in: పరివారజాలఖాతా మీ ఖాతా నుండి వేరు చేయబడినది.

source: You are about to use your %(provider_name)s account to login to %(site_name)s. As a final step, please complete the following form:
te_in: మీరు %(site_name)s లాగిన్ అవ్వడానికి మీ %(provider_name)s ఖాతాను ఉపయోగించబోతున్నారు. చివరి దశగా, దయచేసి క్రింది పత్రాన్ని పూర్తి చేయండి:
