# https://peddabaalasiksha.com/sandhulu-pedda-bala-siksha/

SANDHULU = 'సంధులు'
SANDHULU_SAMSKRUTHA_SANDHULU = 'సంధులు > సంస్కృత సంధులు'
SANDHULU_SAMSKRUTHA_SANDHULU_SAVARNA_DHEERGA_SANDHI = 'సంధులు > సంస్కృత సంధులు > సవర్ణదీర్ఘ సంధి'
SANDHULU_SAMSKRUTHA_SANDHULU_GUNA_SANDHI = 'సంధులు > సంస్కృత సంధులు > గుణ సంధి'
SANDHULU_SAMSKRUTHA_SANDHULU_VRUDDHI_SANDHI = 'సంధులు > సంస్కృత సంధులు > వృద్ధి సంధి'
SANDHULU_SAMSKRUTHA_SANDHULU_YANADESA_SANDHI = 'సంధులు > సంస్కృత సంధులు > యణాదేశ సంధి'
SANDHULU_SAMSKRUTHA_SANDHULU_JASTWA_SANDHI = 'సంధులు > సంస్కృత సంధులు > జశ్త్వ సంధి'
SANDHULU_SAMSKRUTHA_SANDHULU_SCHUTWA_SANDHI = 'సంధులు > సంస్కృత సంధులు > శ్చుత్వ సంధి'

SANDHULU_TELUGU_SANDHULU = 'సంధులు > తెలుగు సంధులు'
SANDHULU_TELUGU_SANDHULU_ACHCHU_SANDHULU = 'సంధులు > తెలుగు సంధులు > అచ్చు సంధులు'
SANDHULU_TELUGU_SANDHULU_ACHCHU_SANDHULU_AKARA_SANDHI = 'సంధులు > తెలుగు సంధులు > అచ్చు సంధులు > అకార సంధి'
SANDHULU_TELUGU_SANDHULU_ACHCHU_SANDHULU_IKARA_SANDHI = 'సంధులు > తెలుగు సంధులు > అచ్చు సంధులు > ఇకార సంధి'

SANDHULU_TELUGU_SANDHULU_HALLU_SANDHULU = 'సంధులు > తెలుగు సంధులు > హల్లు సంధులు'
SANDHULU_TELUGU_SANDHULU_HALLU_SANDHULU_TRIKA_SANDHI = 'సంధులు > తెలుగు సంధులు > హల్లు సంధులు > త్రిక సంధి'

SANDHI_CATEGORY_MAPPING = {
    'సవర్ణదీర్ఘ సంధి': SANDHULU_SAMSKRUTHA_SANDHULU_SAVARNA_DHEERGA_SANDHI,
    'యణాదేశ సంధి': SANDHULU_SAMSKRUTHA_SANDHULU_YANADESA_SANDHI,
    'అకార సంధి': SANDHULU_TELUGU_SANDHULU_ACHCHU_SANDHULU_AKARA_SANDHI,
    'ఇకార సంధి': SANDHULU_TELUGU_SANDHULU_ACHCHU_SANDHULU_IKARA_SANDHI,
    'త్రిక సంధి': SANDHULU_TELUGU_SANDHULU_HALLU_SANDHULU_TRIKA_SANDHI,
}

SANDHI_CATEGORY_NAMES = list(SANDHI_CATEGORY_MAPPING.values())

TELUGU_SANDHULU_DATA = [
    {
        'name': SANDHULU,
        'description': 'అ-ఇ-ఉ-ఋలకు అవే అచ్చులు పరమైనపుడు వాటి దీర్ఘాలు ఏకాదేశమవడాన్ని సవర్ణదీర్ఘ సంధి అంటారు. '
                       'ఉదాహరణలు:- రామ + ఆజ్ఞ = రామాజ్ఞ; మహి + ఈశుడు = మహీశుడు; గురు + ఉపదేశం = గురూపదేశం.',
    },
    {
        'name': SANDHULU_SAMSKRUTHA_SANDHULU,
        'description': """
సంస్కృత సంధుల

<ol>
<li>సవర్ణదీర్ఘ సంధి</li>
<li>గుణ సంధి</li>
<li>వృద్ధి సంధి</li>
<li>యణాదేశ సంధి</li>
<li>జశ్త్వ సంధి</li>
<li>శ్చుత్వ సంధి</li>
<li>అనునాసిక సంధి</li>
<li>విసర్గ సంధి</li>
<li>పరసవర్ణ సంధి</li>
<li>పరరూప సంధి</li>
</ol>
        """,
    },
    {
        'name': SANDHULU_SAMSKRUTHA_SANDHULU_SAVARNA_DHEERGA_SANDHI,
        'description': 'అ-ఇ-ఉ-ఋలకు అవే అచ్చులు పరమైనపుడు వాటి దీర్ఘాలు ఏకాదేశమవడాన్ని సవర్ణదీర్ఘ సంధి అంటారు. '
                       'ఉదాహరణలు:- రామ + ఆజ్ఞ = రామాజ్ఞ; మహి + ఈశుడు = మహీశుడు; గురు + ఉపదేశం = గురూపదేశం.',
    },
    {
        'name': SANDHULU_SAMSKRUTHA_SANDHULU_GUNA_SANDHI,
        'description': 'అకారానికి ఇ-ఉ-ఋలు పరమైతే క్రమంగా ఏ-ఓ-అర్‌లు ఏకాదేశమవడాన్ని గుణసంధి అంటారు. '
                       'ఉదా: సూర్య + ఉదయం = సూర్యోదయం; మహా + ఈశ్వరుడు = మహేశ్వరుడు; ఇతర + ఇతర = ఇతరేతర; '
                       'రాజ + ఋషి = రాజర్షి.',
    },
    {
        'name': SANDHULU_SAMSKRUTHA_SANDHULU_VRUDDHI_SANDHI,
        'description': 'అకారానికి ఏ, ఐలు పరమైతే ఐకారాన్ని; ఓ, ఔలు పరమైతే ఔకారాన్ని; ఋ, ౠలు పరమైతే ఆర్ ఏకాదేశమవడాన్ని వృద్ధి సంధి '
                       'అంటారు. ఐ, ఔలను వృద్ధులు అంటారు. '
                       'ఉదా: భువన + ఏక = భువనైక; అఖండ + ఐశ్వర్యం = అఖండైశ్వర్యం; పాప + ఓఘం = పాపౌఘం; '
                       'పరమ + ఔషధం = పరమౌషధం; ఋణ + ఋణం = ఋణార్ణం',
    },
    {
        'name': SANDHULU_SAMSKRUTHA_SANDHULU_YANADESA_SANDHI,
        'description': 'ఇ-ఉ-ఋలకు అసవర్ణాచ్చులు పరమైతే క్రమంగా య-వ-రలు ఆదేశమవడాన్ని యణాదేశ సంధి అంటారు. '
                       '"ఇకోయణచిః": ఇక్కులకు అనగా (ఇ-ఉ-ఋ) లకు యణ్ణులు అనగా (య-వ-ర) లు పరమవుతున్నందు వలన ఇది యణాదేశ సంధి. '
                       'ఉదా: జయంతి + ఉత్సవం = జయంత్యుత్సవం; హిందూ + ఆర్యులు = హింద్వార్యులు; పితృ + ఆర్జితం = పిత్రార్జితం.',
    },
    {
        'name': SANDHULU_SAMSKRUTHA_SANDHULU_JASTWA_SANDHI,
        'description': 'క-చ-ట-త-ప లకు అచ్చులు కానీ, హ-య-వ-ర-లు కానీ, వర్గ తృతీయ చతుర్థ పంచమాక్షరాలు కానీ, '
                       'పరమైతే గ, జ, డ, ద, బ లు ఆదేశమవడాన్ని జశ్త్వసంధి అంటారు. '
                       'ఉదా: తత్ + అరణ్య భూములు = తదరణ్య భూములు; అచ్ + అంతం = అజంతం; '
                       'వాక్ + ఈశుడు = వాగీశుడు; కకుప్ + అంతం = కకుబంతం, సత్ + భావం = సద్భావం.',
    },
    {
        'name': SANDHULU_SAMSKRUTHA_SANDHULU_SCHUTWA_SANDHI,
        'description': "సకార 'త' వర్గాలకు (సకార-త థ ద ధ న) (త వర్గం) శకార 'చ' వర్గాలు (శకార – చ ఛ జ ఝ ఞ) (చవర్గం) "
                       "పరమైనప్పుడు శకార 'చ' వర్గాలే ఆదేశమవడాన్ని శ్చుత్వ సంధి అంటారు.; "
                       "ఉదా: తపస్ + శమము = తపశ్శమము (స్(స)+శ= శ్శ); సత్+చరిత్ర=సచ్ఛరిత్ర(త్ (త) – చ = చ్ఛ); "
                       "సత్+జనుడు = సజ్జనుడు (త్ (త)+జ= జ్జ) విద్యుత్+శక్తి=విద్యుచ్ఛక్తి (త్ (త)+ శ=చ్ఛ).",
    },
    {
        'name': 'సంధులు > సంస్కృత సంధులు > అనునాసిక సంధి',
        'description': "వర్గ ప్రథమాక్షరాలకు (క-చ-ట-త-ప) 'న, మ' అనునాసిక లు పరమైనప్పుడు ఆయా వర్గానునాసికాలు వికల్పంగా రావడాన్ని "
                       "అనునాసిక సంధి అంటారు. మయాది ప్రత్యయాలకు నిత్యముగా వస్తాయి. "
                       "ఉదా: వాక్ + మయం = వాఙ్మయం (క-ఙ=నిత్యం) జగత్ + నాటకం = జగద్నాటకం = జగన్నాటకం (వికల్పం) "
                       "(అనునాసికం రానప్పుడు వర్గ తృతీయాక్షరం) (త-ద-వికల్పం) మృట్ + మయం = మృణ్మయం, "
                       "మృడ్మయం (ట కు అనునాసికం రానప్పుడు డకారం వికల్పం).",
    },
    {
        'name': 'సంధులు > సంస్కృత సంధులు > విసర్గ సంధి',
        'description': "అకారం పూర్వముందున్న విసర్గకు వర్గ తృతీయ, చతుర్థ, పంచమాక్షరాలు అ-హ-య-వ-ర-ల లు పరమైనప్పుడు విసర్గ 'ఓ' "
                       "కారంగా మారుతుంది. (వర్గ తృతీయాక్షరాలు- గ, జ, డ, బ, లు వర్గ చతుర్థాక్షరాలు (ఘ, ఝ, ఢ, ధ, భ, లు); "
                       "వర్గ పంచమాక్షరాలు ఙ- ఞ- ణ- న-మ్ (అనునాసిక లు) హ-య-వ-ర-ల లు పరమైనప్పుడు మాత్రమే విసర్గ ఓకారంగా "
                       "మారుతుంది. కొన్నిసార్లు రేఫ వస్తుంది. ఉదా: అయః + మయం = అయోమయం (యః + మ = ఓ); "
                       "ఇతః + అధికం = ఇతోధికం (తః+అ = ఓ); చతుః + ఆత్మ = చతురాత్మ (తుః + ఆ = 'ర' కారం వచ్చింది); "
                       "తపః +ఫలము = తపఃఫలం ('ఫ' కారం వర్గ ద్వితీయాక్షరమైనందువల్ల విసర్గలో మార్పు లేదు).",
    },
    {
        'name': 'సంధులు > సంస్కృత సంధులు > పరసవర్ణ సంధి',
        'description': "పదాంతం ముందున్న 'త' కారానికి 'ల' కారం పరమైనప్పుడు 'ల' కారమే ఆదేశంగా రావడాన్ని పర సవర్ణ సంధి అంటారు. "
                       "(త్ – తకారానికి లకారం వస్తే 'ల్ల' కారం వస్తుంది). ఉదా: భగవత్ + లీల = భగవల్లీల (త్ + ల = ల్ల); "
                       "ఉత్ + లేఖనం = ఉల్లేఖనం (త్+లే = ల్లే); విద్యుత్ + లత = విద్యుల్లత (త్ + ల = ల్ల); "
                       "సుహృత్ + లాభం = సుహృల్లాభం (త్ + లా = ల్లా).",
    },
    {
        'name': 'సంధులు > సంస్కృత సంధులు > పరరూప సంధి',
        'description': "హల్లుల్లోని అకారానికి అకారం పరమైతే రెండో పదంలోని మొదటి అచ్చు ఏకాదేశమవుతుంది. "
                       "దీన్ని పరరూపసంధి అంటారు.ఉదా: సార + అంగము = సారంగము (ర్ + అ = రకారంలోని అకారానికి 'అ' కారం పరమై "
                       "రకారానికి దీర్ఘం వచ్చింది); సీమ + అంతము = సీమంతము (మ్ + అకారానికి అకారం పరమై అకార దీర్ఘం వచ్చింది).",
    },

    {
        'name': 'సంధులు > తెలుగు సంధులు',
        'description': "వర్ణాలనిబట్టి సంధులు రెండు రకములు. <ol><li>అచ్చు సంధి</li><li>హల్లు సంధి</li></ol>",
    },
    {
        'name': 'సంధులు > తెలుగు సంధులు > అచ్చు సంధులు',
        'description': """
అచ్చు సంధులు:

<ol>
    <li>అకార సంధి</li>
    <li>యడాగమ సంధి</li>
    <li>ఇకార సంధి</li>
    <li>ఉకార సంధి</li>
    <li>ఆమ్రేడిత సంధి</li>
</ol>
        """,
    },
    {
        'name': SANDHULU_TELUGU_SANDHULU_ACHCHU_SANDHULU_AKARA_SANDHI,
        'description': 'అత్తునకు సంధి బహుళం. బహుళమంటే నిత్యం, నిషేధం, వైకల్పికం, అన్యవిధం అనే నాలుగు కార్యాలు ఉంటాయి. '
                       '<ol>'
                       '<li>నిత్యంగా జరిగేవి – ఉదా: రామ + అయ్య = రామయ్య (నిత్యం);</li>'
                       '<li>సంధి జరగని నిషేధ రూపం – ఉదా: దూత + ఇతడు = దూతయితడు (యడాగమ రూపం)</li>'
                       '<li>వైకల్పికంగా జరగడం – సంధి జరిగిన రూపం, సంధి జరగని యడాగమ రూపం రెండూ వస్తాయి. '
                       'ఉదా: మేన + అల్లుడు = మేనల్లుడు (సంధి జరిగిన రూపం) మేనయల్లుడు (సంధి జరుగని యడాగమ రూపం)</li>'
                       '<li>అన్యవిధం – సూత్రంలో సూచించని విధంగా కొన్ని హల్లులు వచ్చి చేరతాయి. ఉదా : తామర + ఆకు = తామరపాకు. '
                       'పుగాగమం అన్య విధంగా వచ్చి చేరింది.</li>'
                       '</ol>',
    },
    {
        'name': 'సంధులు > తెలుగు సంధులు > అచ్చు సంధులు > యడాగమ సంధి',
        'description': "సంధి లేని చోట స్వరంబు కంటే పరంబైన స్వరంబునకు యడాగమంబగు. "
                       "సంధి జరిగే అవకాశం లేనప్పుడు పర స్వరానికి ముందు 'య్' కారం ఆగమంగా వచ్చి "
                       "చేరుతుంది. ఉదా: వెల + (య్) ఆలు = వెలయాలు; మా + (య్) అమ్మ = మాయమ్మ.",
    },
    {
        'name': SANDHULU_TELUGU_SANDHULU_ACHCHU_SANDHULU_IKARA_SANDHI,
        'description': """
ఇత్తునకు సంధి వైకల్పికం. ఏమ్యాదుల్లో ఇత్తునకు సంధి వైకల్పికం (ఏమి, మరి, అది, అవి, ఇది, ఇవి, కాన్) మొదలైనవి ఏమ్యాదులు.
ఉదా: ఏమి + అంటివి = ఏమంటివి, ఏమియంటివి (సంధి జరిగిన) (సంధి జరుగని) మధ్యమ పురుష క్రియలందు ఇత్తునకు సంధి నిత్యం.
ఉదా: చూచితిరి + ఇపుడు = చూచితిరిప్పుడు.
క్త్వార్థంబైన ఇత్తునకు సంధి లేదు. భూతకాలిక అసమాపక క్రియ క్త్వార్థంబు. ఉదా: వచ్చి + ఇచ్చి = వచ్చియిచ్చి (సంధి లేనందువల్ల యడాగమ రూపం).
        """,
    },
    {
        'name': 'సంధులు > తెలుగు సంధులు > అచ్చు సంధులు > ఉకార సంధి',
        'description': """
ఉత్తునకచ్చుపరమైనప్పుడు సంధి నిత్యముగా వస్తుంది (హ్రస్వమైన ఉకారానికి మాత్రమే ఇది వర్తిస్తుంది ఉదా: రాముడు + అతడు = రాముడతడు
(డు లోని ఉ కారానికి అకారం పరమై అకారం నిత్యంగా వచ్చింది). ప్రథ‌మేత‌ర‌ విభక్తి శత్రర్థక చువర్ణంబులందున్న ఉకారానికి సంధి వైకల్పికం అవుతుంది.
ప్రథమా విభక్తి కాకుండా ఇతర విభక్తుల్లో శత్రర్థకమైన 'చున్' ప్రత్యయంలోని ఉకారానికి సంధి వైకల్పికమని అర్థం.
వైకల్పికమంటే ఒకసారి సంధి జరిగిన రూపం, మరోసారి సంధి జరగని రూపం సిద్ధిస్తుంది. ఉదా: నన్నున్ + అడిగె = నన్నెడిగె (సంధి జరిగిన రూపం)
నన్నునడిగె (సంధి జరగని రూపం).
        """,
    },
    {
        'name': 'సంధులు > తెలుగు సంధులు > అచ్చు సంధులు > ఆమ్రేడిత సంధి',
        'description': """
<p>అచ్చునకు ఆమ్రేడితం పరమైనప్పుడు సంధి తరచుగానగు. ద్విరుక్తం పదరూపం ఆమ్రేడితం. ఒక పదాన్ని రెండుసార్లు ఉచ్ఛరించినప్పుడు
రెండోసారి ఉచ్ఛరించినదాన్ని ఆమ్రేడితమంటారు.  ఉదా: ఔర + ఔర (ఆమ్రేడితం) ఔరౌర; ఆహా + ఆహా = ఆహాహా;</p>

<p>ఆమ్రేడితం పరమైనప్పుడు కడాదుల తొలి అచ్చు మీది వర్ణంబులకెల్లా అదంతంబగు ద్విరుక్తటకారంబగు
(కడాదులు: కడ, చివర, తుద, మొదలు, తెరువు, నడుమ మొదలైనవి) ఉదా: క(డ)ట్ట + కడ = కట్టకడ; చివ(ట్ట)ర + చివర = చిట్టచివర కడాదుల్లో
తొలి అచ్చు తర్వాత వర్ణాలన్నింటికీ లోపం వచ్చి వాటి స్థానంలో అదంతమైన ద్విత్వట్టకారం వచ్చింది. అందదుకు ప్రభృతులు యథా ప్రయోగంబుగా గ్రాహ్యములు.
ఉదా: అందుకు + అదుకు = అందదుకు; చెర + చెర = చెచ్చెర లాంటి రూపాలు యథావిథిగా గ్రహించవచ్చని చిన్నయ సూరి గారి అభిప్రాయం.
</p>
        """,
    },

    {
        'name': 'సంధులు > తెలుగు సంధులు > హల్లు సంధులు',
        'description': """
హల్లు సంధులు:-

<ol>
    <li>గసడదవాదేశ సంధి</li>
    <li>సరళాదేశ సంధి</li>
    <li>పుంప్వాదేశ సంధి</li>
    <li>ద్విరుక్తటకారాదేశ సంధి</li>
    <li>టుగాగమ సంధి</li>
    <li>రుగాగమ సంధి</li>
    <li>దుగాగమ సంధి</li>
    <li>నుగాగమ సంధి</li>
    <li>పడ్వాది సంధి</li>
    <li>త్రిక సంధి</li>
    <li>ద్విగు సమాస సంధి</li>
    <li>బహువ్రీహి సమాస సంధి</li>
    <li>ప్రాతాది సంధి</li>
</ol>
        """,
    },
    {
        'name': 'సంధులు > తెలుగు సంధులు > హల్లు సంధులు > గసడదవాదేశ సంధి',
        'description': "ప్రథమం మీది పరుషాలకు గ, స, డ, ద, వలు బహుళముగానగు. "
                       "ప్రథమావిభక్తిలో ఉన్న పదాలకు పరమైన పదాల్లో ఉన్న పరుషాలకు (క చ ట త ప లకు క్రమంగా గ, స, డ, వలు) "
                       "బహుళంగా వస్తాయి. ఉదా: వాడు + కొట్టె = వాడు గొట్టె; అపుడు + చనియె = అపుడుసనియె; "
                       "ద్వంద్వ సమాసాల్లో పదాలపై పరుషాలకు గ, స, డ, ద, వలు ప్రాయికంగా వస్తాయి. "
                       "ఉదా: తల్లి + తండ్రి = తల్లిదండ్రులు. తెనుగుల మీది సాంస్కృతిక పరుషాలకు గ, స, డ, ద, వలు రావు. "
                       "తెలుగు పదాలకు పరంగా వచ్చిన తత్సమ పదాల్లోని పరుషాలకు గ, స, డ, ద, వలు రావు. ఉదా: "
                       "వాడు + కంసారి = వాడు కంసారి. వీడు + చక్రపాణి = వీడు చక్రపాణి "
                       "(ఈ ఉదాహరణలో క, చ అనే పరుషాలకు గ, స, లు రాలేదు).",
    },
    {
        'name': 'సంధులు > తెలుగు సంధులు > హల్లు సంధులు > సరళాదేశ సంధి',
        'description': "ద్రుత, ప్రకృతికము మీది పరుషములకు సరళములగు. ద్రుతమనగా నకారము – నుకారము – న్ – లుగా గ్రహించవలెను. "
                       "ద్రుతప్రకృతికముల తరువాత నున్న క చ ట త ప అను వర్ణములకు సరళములగు గ జ డ ద బ లు ఆదేశములగును. "
                       "క చ ట త ప - పరుషములు; గ జ డ ద బ - సరళములగు. "
                       "ఉదా: పూచెను + కలువలు = పూచెనుగలువలు; తోచెన్ + చుక్కలు = తోచెనుజుక్కలు; "
                       "చేసెన్ + టక్కులు = చేసెను డక్కులు; నెగడెన్ + తమములు = నెగదెను దమములు; "
                       "మొగిడెను + పద్మము = మొగిడెను బద్మము. ఆదేశ సరళములకు ముందున్న ద్రుతమునకు బిందు సంశ్లేషణలు విభాషనగు. "
                       "ఆదేశ సరళములనగా, వ్యాకరణ కార్యము వల్ల వచ్చిన గ జ డ ద బ లు. బిందువు – సున్న – ౦; "
                       "ఖండబిందువు – అరసున్న – సి; సంశ్లేషమనగా మీది హల్లుతో కూడిక. ఆదేశ సరళములకు, "
                       "ముందున్న ద్రుతమునకు బిందువుగాని – సంశ్లేషముగాని, వచ్చునని సూత్రార్ధము. ఉదా: పూచెను + గలువ = ఇందలి 'గ' "
                       "ఆదేశ సరళము. పూచెంగలువలు = బిందువు. పూచెంగలువలు = ఖండబిందువు; పూచెన్గలువలు = సంశ్లేషము. "
                       "తోచెను + జుక్కలు = తోచెంజుక్కలు – తోచెంజుక్కలు – తోజెన్జుక్కలు. చేసెను + టెక్కులు = చేసెండెక్కులు – చేసెండెక్కులు – చేసెన్డెక్కులు. "
                       "నెగడెను + దమము = నెగడెందమము – నెగడెందమము – నెగడెన్దమము. మొగిడెను + బద్మము = మొగిడెంబద్మము – "
                       "మొగిడెఁబద్మము – (మొగిడెన్బద్మము). ",
    },
    {
        'name': 'సంధులు > తెలుగు సంధులు > హల్లు సంధులు > పుంప్వాదేశ సంధి',
        'description': "కర్మధారయమందలి 'ము' వర్ణానికి 'పుంపు'లగు ము వర్ణానికి 'పువర్ణం' బిందు పూర్వక పువర్ణం (ంపు) "
                       "రెండు రూపాలు వస్తాయి. ఉదా: సరసము + మాట = సరసపు మాట; సరసంపు మాట; "
                       "విరసము + వచనం = విరసపు వచనం విరసంపు వచనం; "
                       "సౌందర్యము + పాలు = సౌందర్యపుపాలు – సౌందర్యంపుపాలు; ఆకాశము + పందిరి = ఆకాశపుపందిరి – ఆకాశంపుపందిరి.",
    },
    {
        'name': 'సంధులు > తెలుగు సంధులు > హల్లు సంధులు > ద్విరుక్తటకారాదేశ సంధి',
        'description': "కుఱు – చిఱు – కడు – నడు – నిడు శబ్దముల ఱ – డ లకు అచ్చు పరంబగునపుడు ద్విరుక్తటకారంబగు. "
                       "కుఱు – చిఱు అను పదములలోని 'ఱ' కారమునకు – నడు – నిడు – కడు పదములలోని 'డ' కారమునకు – అచ్చుతో మొదలైన "
                       "పదములు పరమైన, ద్విరుక్తమగు 'ట్ట్' ఆదేశమగును. ఱ – డ లు అనగా ఱకార, డ కారములు. "
                       "ద్విరుక్తమనగా రెండు మారులు పలుకబడుట – ద్విత్వము. ఉదా: – కుఱు + ఉసురు = కుట్ + ట్ + ఉసురు = కుట్టుసురు. "
                       "చిఱు + ఎలుక = చిట్ + ట్ + ఎలుక = చిట్టెలుక.  నడు + ఇల్లు = నట్ + ట్ + ఇల్లు = నట్టిల్లు. "
                       "నిడు + ఊర్పు = నిట్ + ట్ + ఊర్పు = నిట్టూర్పు.  కడు + అలుక = కట్ + ట్ + అలుక = కట్టలుక.",
    },
    {
        'name': 'సంధులు > తెలుగు సంధులు > హల్లు సంధులు > టుగాగమ సంధి',
        'description': "కర్మధారయంలో ఉత్తునకు అచ్చు పరమైనప్పుడు టుగాగమంబగుతుంది. "
                       "వివరణ: నామవాచక, విశేషణాలకు సంబంధించిన సమాసం కర్మధారయ సమాసం. "
                       "ఇందులో పరస్వరానికి ముందు 'ట్' కారం ఆగమంగా వస్తుంది. ఉదా: కఱకు+ (ట్) అమ్ము = కఱకుటమ్ము. "
                       "కర్మధారయమున పేర్వాది శబ్దాలకు అచ్చు పరమైనప్పుడు టుగాగమంబు విభాషనగు. "
                       "పేర్వాదులు: పేరు, పొదరు, చిగురు, తలిరు.  ఉదా: పేరు + ఉరము = పేరుటురము (టుగాగగం రానప్పుడు)",
    },
    {
        'name': 'సంధులు > తెలుగు సంధులు > హల్లు సంధులు > రుగాగమ సంధి',
        'description': "కర్మధారయంబున 'పేరాది' శబ్దాలకు 'ఆలు' శబ్దం పరమైనప్పుడు రుగాగమంబగు. "
                       "పేరాది శబ్దాలు: పేద, బీద, ముగ్ధ, కొమ, జవ, మనుమ, ఐదవ మొదలైనవి. "
                       "ఉదా: పేద (ర్) + ఆలు = పేదరాలు. పరస్వరానికి ముందు 'ర్' కారం చేరి పేదరాలు రూపం వచ్చింది. "
                       "మనుమ(ర్) + ఆలు = మనుమరాలు. కర్మధారయంబున తత్సమ పదాలకు 'ఆలు' శబ్దం పరమైనప్పుడు అత్వంబునకు "
                       "ఉత్వంబు రుగాగమవుతుంది. (తత్సమ శబ్దాలు: ధీర, గుణవంత, ధనవంత, సంపన్న, గంభీర, "
                       "ధైర్యవంత మొదలైనవి) ఉదా: ధీర + ఆలు = ధీరు+ ర్ + ఆలు = ధీరురాలు; "
                       "గుణవంత + ఆలు = గుణవంతు + ర్ +ఆలు= గుణవంతురాలు.",
    },
    {
        'name': 'సంధులు > తెలుగు సంధులు > హల్లు సంధులు > దుగాగమ సంధి',
        'description': "నీ- నా- తన శబ్దాలకు ఉత్తర పదంబు పరమైనప్పుడు దుగాగమంబు విభాషనగు. "
                       "ఉదా: నా + (దు) విభుడు = నాదువిభుడు (సంధి జరిగిన రూపం) నా విభుడు (సంధి జరగని రూపం) "
                       "తన + (దు) కోపం = తనదు కోపం (సంధి జరిగిన రూపం) తన కోపం (సంధి జరగని రూపం).",
    },
    {
        'name': 'సంధులు > తెలుగు సంధులు > హల్లు సంధులు > నుగాగమ సంధి',
        'description': "ఉదంత తద్ధర్మార్థ విశేషణానికి అచ్చుపరమైనప్పుడు నుగామమంబగు. తద్ధర్మార్థకాలు: భూత, భవిష్యత్, వర్తమాన కాలాల్లో జరిగే "
                       "క్రియలు. హ్రస్వమైన ఉకారం చివర ఉన్న తద్ధర్మార్థక క్రియలకు అచ్చుపరమైతే నుగాగమం వస్తుందని సూత్రార్థం. "
                       "ఉదా: చేయు + (న్) ఎడ = చేయునెడ; వ్రాయు + (న్) అది = వ్రాయునది. షష్ఠీ తత్పురుష సమాస మందలి ఉకార, "
                       "ఋకారంబులకు అచ్చుపరమైనప్పుడు నుగామంబగు. ఉదా: రాజు + (న్) ఆనతి = రాజునానతి. "
                       "చెరువు + (న్) ఉదకం = చెరువునుదకం.",
    },
    {
        'name': 'సంధులు > తెలుగు సంధులు > హల్లు సంధులు > పడ్వాది సంధి',
        'description': "పడ్వాదులు, పరంబగునపుడు 'ము' వర్ణమునకు లోప, పూర్ణబిందువులు విభాషనగు. "
                       "భయము + పడె – భయపడె; భయంపడె; భయముపడె. సూత్రము + పట్టె – సూత్రపట్టె; సూత్రం పట్టె; సూత్రముపట్టె. "
                       "పడ్వాదులు – పడు – పెట్టు మొదలగునవి. ఈ కార్యము కర్తృవాచి 'ము' వర్ణమునకు కలుగదు. "
                       "గజముపడియె – అశ్వము పడియె. పడు – మొదలగునవి. పరంబగునపుడు ప్రథమా విభక్తి ప్రత్యయముగల 'ము' వర్ణమునకు "
                       "లోపముగాని పూర్ణ బిందువుగాని వికల్పముగా వచ్చును. భయము + పడె = భయపడె. 'ము' వర్ణము లోపించినది. "
                       "పూర్ణ బిందువు రాగా భయంపడె రూపము కల్గును. ఈ లోప – పూర్ణ బిందువులు రానిచో భయముపడె అని లోపముకాని "
                       "రూపమే యుండును. ఇట్లే రెండవ ఉదాహరణము గ్రహించునది. ఈ 'ము' వర్ణలోపము కర్తను దెల్పు పదమునకు కలుగదు. "
                       "గజముపడె – ఇది పడియె అను క్రియాపదమునకు గజము కర్త. దాని 'ము' వర్ణమునకు లోపము రాదు. "
                       "పూర్ణ బిందువును కలుగదు. గజంపడియె – అశ్వంపడియె – అనునవి అసాధు రూపములు.",
    },
    {
        'name': SANDHULU_TELUGU_SANDHULU_HALLU_SANDHULU_TRIKA_SANDHI,
        'description': "ఆ, ఈ, ఏ అనే సర్వనామాలను త్రికములు అంటారు. ఉదా: ఆ + కన్య. "
                       "త్రికంబు మీది అసంయుక్త హల్లునకు ద్విత్వం బహుళంగా వస్తుంది. "
                       "రెండవ సూత్రము వలన ఉత్తర పదాది అక్షరమైన 'క' అసంయుక్తము కావున దానికి ద్విత్వము వచ్చి ఆ + క్కన్య అయినది. "
                       "మూడవ సూత్రము వలన ద్విరుక్తమైన హల్లుకు పూర్వమందున్న ఆచ్చికమగు ఆకారము హ్రస్వమై – అకారమగును. "
                       "అప్పుడు అక్కన్య – అను రూపమేర్పడును. ఆచ్చికములు – తెలుగు పదములు, ద్విరుక్తము. రెండుసార్లు ఉచ్చరించబడునది. "
                       "ఆ + కాన = అక్కాన; ఈ + కాన = ఇక్కాన; ఏ + కాన = ఎక్కాన.  అట్లే అత్తరి – ఇత్తరి – ఎత్తరి – రూపములు గ్రహించునది. "
                       "ద్విరుక్తంబగు హల్లు పరమైనప్పుడు ఆచ్ఛికంబగు దీర్ఘం హ్రస్వం అవుతుంది. "
                       "ఉదా: ఆ + క్కన్య = అక్కన్య మూడు సూత్రాలతో – అక్కన్య రూపం వస్తుంది.",
    },
    {
        'name': 'సంధులు > తెలుగు సంధులు > హల్లు సంధులు > ద్విగు సమాస సంధి',
        'description': "సమానాధికరణంబగు ఉత్తర పదంబు పరంబగునపుడు 'మూడు' శబ్దములోని 'డు' వర్ణమునకు లోపంబును, "
                       "మీది హల్లునకు ద్విత్వంబునగు. ఉదా: మూడు+లోకములు=ముల్లోకములు.",
    },
    {
        'name': 'సంధులు > తెలుగు సంధులు > హల్లు సంధులు > బహువ్రీహి సమాస సంధి',
        'description': 'బహువ్రీహిని స్త్రీ వాచ్యంబునగుచో ఉపమానంబు మీది మేనునకు బోడియగు. ఉదా: అలరు+మేను=అలరుఁ బోడి.',
    },
    {
        'name': 'సంధులు > తెలుగు సంధులు > హల్లు సంధులు > ప్రాతాది సంధి',
        'description': 'సమాసంబులన్ ప్రాతాదుల తొలి యచ్చుమీది వర్ణంబుల కెల్ల లోపంబు బహుళంబుగానగు. ఉదా: క్రొత్త+గండి=క్రొగ్గండి.',
    },
]
